---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings
source: html/fbb6dfb2-3292-619c-13f9-3552bb40dca9.htm
---
# PointCloudColorSettings Methods

Assigns values of the source settings to this object.